src/cf/InformationRegisters/GDS_ДанныеАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ДанныеАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ДанныеАПП/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Идентификатор = Строка(Запись.Идентификатор);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	GDS_ДанныеАПП.Данные
		|ИЗ
		|	РегистрСведений.GDS_ДанныеАПП КАК GDS_ДанныеАПП
		|ГДЕ
		|	GDS_ДанныеАПП.Идентификатор = &Идентификатор");
	Запрос.УстановитьПараметр("Идентификатор", Запись.Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Данные = Выборка.Данные.Получить();
		Если СтрДлина(Данные) <> 0 Тогда
			
			ТекстДок = Новый ТекстовыйДокумент;

			ТекстДок.ДобавитьСтроку(Данные.Модель);
			ТекстДок.ДобавитьСтроку("Ид:" +Данные.Модель.Ид);
			ТекстДок.ДобавитьСтроку("Наименование:" +Данные.Модель.Наименование);
			
			//БСП ("СкопироватьУниверсальнуюКоллекцию")
			JSON_Строка = ЗаписатьСтруктуруJSON(Данные);
			
			//ТекстДок.ПолучитьТекст();
			
			//ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
			//Данные.Записать(ИмяВременногоФайла);
			
			//ФайлСДанными = Новый Файл(ИмяВременногоФайла);
			//Размер = ФайлСДанными.Размер() / 1024;	// Кб
			
			//ТекстовыйДокумент = Новый ТекстовыйДокумент;
			//ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
			ТекстСообщения = JSON_Строка;
			//УдалитьФайлы(ИмяВременногоФайла);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьСтруктуруJSON(Структура)
	ЗаписиJSON = Новый ЗаписьJSON;
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписиJSON.УстановитьСтроку(ПараметрыЗаписи);
	
	НастройкиСериал = Новый НастройкиСериализацииJSON;
	
	НастройкиСериал.ВариантЗаписиДаты  = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкиСериал.ФорматСериализацииДаты  = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(ЗаписиJSON, Структура, НастройкиСериал);
	
	JSONОбъект = ЗаписиJSON.Закрыть(); 
	
	Возврат JSONОбъект;
КонецФункции


#КонецОбласти
